// Package maps ... 返回code
/*
 * @Description: 备注
 * @Author: Dawn
 * @Date: 2019-08-05 10:28:04
 * @LastEditTime: 2019-10-23 15:18:18
 * @LastEditors: Dawn
 */
package maps

// Msg make maps
var Msg = map[int]string{
	-1: "系统异常",
	0:  "请求成功",
	1:  "参数异常",
	2:  "登录失败",
	3:  "token失效",
	4:  "账号密码错误",
	5:  "该账号没有登录权限，请联系管理员",
	6:  "已被注册，请更换！",
	7:  "缓存token取出失败",
	8:  "用户权限不足",
	9:  "用户不存在，请重新注册",
	10: "设备未注册",
	11: "未找到设备的物联网关,请联系管理人员",
	12: "安装工未配置权限,请联系管理员",
	90: "链接数据库失败",
	91: "数据库查询失败",
	92: "插入数据库失败",
	93: "更新数据库失败",
	98: "验证码输入错误",
	99: "数据不存在",
}

// Code make maps
var Code = map[string]int{
	"系统异常": -1,
	"请求成功": 0,
	"参数异常": 1,
	"登录失败": 2,
	"token失效": 3,
	"账号密码错误":  4,
	"该账号没有登录权限，请联系管理员":   5,
	"该账号已被注册，请更换账号！":     6,
	"生成token失败":          7,
	"用户权限不足":             8,
	"用户不存在，请重新注册":              9,
	"设备未注册":              10,
	"未找到设备的物联网关,请联系管理人员": 11,
	"安装工未配置权限,请联系管理员":    12,
	"链接数据库失败":            90,
	"数据库查询失败":            91,
	"插入数据库失败":            92,
	"更新数据库失败":            93,
	"验证码输入错误":            98,
	"数据不存在":              99,
}
